fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область  ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда) 

	ДанныеДоговоровДляЗаполнения = Новый Структура;
	ДанныеДоговоровДляЗаполнения.Вставить("Период", Объект.Период);
	
	СтруктураФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(ДанныеДоговоровДляЗаполнения, УникальныйИдентификатор);
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект), ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере	
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Создание реализаций";
	ВыполняемыйМетод = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРту";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРту", Объект.Период); 
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	МассивДокументов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ДанныеДоговоровДляЗаполнения(МассивДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ДанныеДоговоровДляЗаполнения(МассивДокументов)
	
	Объект.Договоры.Очистить();
	
	Для Каждого Документ из МассивДокументов Цикл
		
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = Документ.Договор;
		НоваяСтрока.Реализация = Документ;
		
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти
